NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_secure.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120_NS">
      <name>GLOBAL_SPIM120_S</name>
      <description>Serial Peripheral Interface Master with EasyDMA 1</description>
      <baseAddress>0x5F8E6000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SPIM120_UARTE120</name>
        <value>230</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE120_NS">
      <name>GLOBAL_UARTE120_S</name>
      <description>UART with EasyDMA 1</description>
      <baseAddress>0x5F8E6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM120_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SPIM120_UARTE120</name>
        <value>230</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120_NS">
      <name>GLOBAL_SPIM121_NS</name>
      <description>Serial Peripheral Interface Master with EasyDMA 2</description>
      <baseAddress>0x4F8E7000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SPIM121</name>
        <value>231</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120_NS">
      <name>GLOBAL_SPIM121_S</name>
      <description>Serial Peripheral Interface Master with EasyDMA 3</description>
      <baseAddress>0x5F8E7000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SPIM121</name>
        <value>231</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_VPR121_NS">
      <name>GLOBAL_VPR130_NS</name>
      <description>VPR peripheral registers 2</description>
      <baseAddress>0x4F908000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>VPR130</name>
        <value>264</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_VPR121_NS">
      <name>GLOBAL_VPR130_S</name>
      <description>VPR peripheral registers 3</description>
      <baseAddress>0x5F908000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>VPR130</name>
        <value>264</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_IPCT120_NS">
      <name>GLOBAL_IPCT130_NS</name>
      <description>IPCT APB registers 2</description>
      <baseAddress>0x4F921000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
      <interrupt>
        <name>IPCT130_0</name>
        <value>289</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_IPCT120_NS">
      <name>GLOBAL_IPCT130_S</name>
      <description>IPCT APB registers 3</description>
      <baseAddress>0x5F921000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
      <interrupt>
        <name>IPCT130_0</name>
        <value>289</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_DPPIC120_NS">
      <name>GLOBAL_DPPIC130_NS</name>
      <description>Distributed programmable peripheral interconnect controller 2</description>
      <baseAddress>0x4F922000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_DPPIC120_NS">
      <name>GLOBAL_DPPIC130_S</name>
      <description>Distributed programmable peripheral interconnect controller 3</description>
      <baseAddress>0x5F922000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral>
      <name>IPCMAP_S</name>
      <description>IPCMAP registers</description>
      <baseAddress>0x5F923000</baseAddress>
      <headerStructName>IPCMAP</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>IPCMAP</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <dim>16</dim>
          <dimIncrement>0x008</dimIncrement>
          <name>CHANNEL[%s]</name>
          <description>Unspecified</description>
          <headerStructName>IPCMAP_CHANNEL</headerStructName>
          <access>read-write</access>
          <addressOffset>0x400</addressOffset>
          <register>
            <name>SOURCE</name>
            <description>Description cluster: The IPCT source configuration for the IPCMAP channel [n].</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SOURCE</name>
                <description>Source IPCT channel number.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>DOMAIN</name>
                <description>Domain identifier.</description>
                <lsb>8</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>ENABLE</name>
                <description>Channel enable.</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable channel.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable channel.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SINK</name>
            <description>Description cluster: The IPCT sink configuration for the IPCMAP channel [n].</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SINK</name>
                <description>Sink IPCT channel number.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>DOMAIN</name>
                <description>Domain identifier.</description>
                <lsb>8</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
        </cluster>
